/* ΕΑΝ Ο ΒΑΘΜΟΣ ΤΟΥ ΣΠΟΥΔΑΣΤΗ ΕΙΝΑΙ ΜΕΓΑΛΥΤΕΡΟΣ 'Η ΙΣΟΣ ΜΕ 90 : ΠΡΟΒΑΛΕ "A" */
/* ΔΙΑΦΟΡΕΤΙΚΑ - ΕΑΝ Ο ΒΑΘΜΟΣ ΤΟΥ ΣΠΟΥΔΑΣΤΗ ΕΙΝΑΙ ΜΕΓΑΛΥΤΕΡΟΣ 'Η ΙΣΟΣ ΜΕ 80 : ΠΡΟΒΑΛΕ "B" */
/* ΔΙΑΦΟΡΕΤΙΚΑ - ΕΑΝ Ο ΒΑΘΜΟΣ ΤΟΥ ΣΠΟΥΔΑΣΤΗ ΕΙΝΑΙ ΜΕΓΑΛΥΤΕΡΟΣ 'Η ΙΣΟΣ ΜΕ 70 : ΠΡΟΒΑΛΕ "Γ" */
/* ΔΙΑΦΟΡΕΤΙΚΑ - ΕΑΝ Ο ΒΑΘΜΟΣ ΤΟΥ ΣΠΟΥΔΑΣΤΗ ΕΙΝΑΙ ΜΕΓΑΛΥΤΕΡΟΣ 'Η ΙΣΟΣ ΜΕ 60 : ΠΡΟΒΑΛΕ "Δ" */
/* ΔΙΑΦΟΡΕΤΙΚΑ - ΠΡΟΒΑΛΕ "Ε" */


/* ΣΕ ΓΛΩΣΣΑ C Ο ΚΩΔΙΚΑΣ ΘΑ 'ΗΤΑΝ -ΜΕ ΠΡΟΥΠΟΘΕΣΗ Α=Α,Β=Β,Γ=C,Δ=D,Ε=Ε- ΕΤΣΙ */

if(grade >= 90 ) 

          {/*1 bracket*/

             puts("A");

           }/*2 bracket*/


   else {/*2 bracket*/

        if(grade>=80)

           {/*3 bracket*/

            puts("B");

            }/*3 bracket*/

         }/*2 bracket*/


 /*ΙΔΙΟΣ ΚΩΔΙΚΑΣ ΙΔΙΑ ΛΟΓΙΚΗ-SAME CODE SAME LOGIC*/



            /*.........C.O.D.E.........*/




    else {/*N bracket*/


        puts("E"); /*Specific use-Συγκεκριμένη περίπτωση-------Φτάνει μέχρι Ν*/


          }/*Ν bracket*/


































